benchmarks/results/20260908T1645Z_fp8kv-rx5/rx5-full-v2-quick/logs/decode_in256_out256_c4_r2.log
INFO 09-08 17:18:15 [importing.py:45] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 09-08 17:18:15 [importing.py:69] Triton not installed or not compatible; certain GPU-related functions will not be available.
WARNING 09-08 17:18:15 [interface.py:247] Failed to import from vllm._C: ImportError('libcuda.so.1: cannot open shared object file: No such file or directory')
Namespace(trust_remote_code=False, seed=20275532, num_prompts=8, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://127.0.0.1:11435', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=4, model='Qwen3.8-27B-Quark-AWQ-MXFP4', input_len=256, output_len=256, tokenizer='/nvme/lexar-2/ai/models/Qwen3.8-27B-Quark-AWQ-MXFP4-amd', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=True, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=['config=rx5-full-v2-quick', 'workload=decode', 'input_tokens=256', 'output_tokens=256', 'repetition=2', 'tp=2', 'spec=on', 'cpu_offload_gb=0', 'seed=20275532', 'temperature=0'], result_dir=None, result_filename='benchmarks/results/20260908T1645Z_fp8kv-rx5/rx5-full-v2-quick/raw/decode_in256_out256_c4_r2.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-6c9a64c4-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 09-08 17:18:16 [utils.py:90] Sampling input_len from [256, 256] and output_len from [256, 256]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 4
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     8         
Failed requests:                         0         
Maximum request concurrency:             4         
Benchmark duration (s):                  4.64      
Total input tokens:                      2048      
Total generated tokens:                  2048      
Request throughput (req/s):              1.72      
Output token throughput (tok/s):         441.58    
Peak output token throughput (tok/s):    118.00    
Peak concurrent requests:                6.00      
Total token throughput (tok/s):          883.16    
---------------Time to First Token----------------
Mean TTFT (ms):                          184.31    
Median TTFT (ms):                        147.09    
P50 TTFT (ms):                           147.09    
P90 TTFT (ms):                           269.63    
P95 TTFT (ms):                           269.78    
P99 TTFT (ms):                           269.90    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          7.22      
Median TPOT (ms):                        6.23      
P50 TPOT (ms):                           6.23      
P90 TPOT (ms):                           10.72     
P95 TPOT (ms):                           12.35     
P99 TPOT (ms):                           13.65     
---------------Inter-token Latency----------------
Mean ITL (ms):                           32.97     
Median ITL (ms):                         30.91     
P50 ITL (ms):                            30.91     
P90 ITL (ms):                            31.39     
P95 ITL (ms):                            31.98     
P99 ITL (ms):                            118.29    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          2026.61   
Median E2EL (ms):                        1796.16   
P50 E2EL (ms):                           1796.16   
P90 E2EL (ms):                           2917.87   
P95 E2EL (ms):                           3375.62   
P99 E2EL (ms):                           3741.82   
---------------Speculative Decoding---------------
Acceptance rate (%):                     51.81     
Acceptance length:                       4.63      
Drafts:                                  447       
Draft tokens:                            3129      
Accepted tokens:                         1621      
Per-position acceptance (%):
  Position 0:                            77.63     
  Position 1:                            67.11     
  Position 2:                            57.49     
  Position 3:                            49.44     
  Position 4:                            46.09     
  Position 5:                            33.78     
  Position 6:                            31.10     
==================================================